In [3]:
import pandas as pd
st = pd.read_csv('E:\\ASSIGNMENT FROM EXCELR\\Naive Bayes\\SalaryData_Test.csv')

In [4]:
st.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [5]:
st.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [6]:
st.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  object
 2   education      15060 non-null  object
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  object
 5   occupation     15060 non-null  object
 6   relationship   15060 non-null  object
 7   race           15060 non-null  object
 8   sex            15060 non-null  object
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  object
 13  Salary         15060 non-null  object
dtypes: int64(5), object(9)
memory usage: 1.6+ MB

# "Data Cleaning"

In [7]:
import re #regular expression
import string
def clean_text(text):
    '''Make text lowercase, remove text in square brackets, remove punctuation and remove words containing numbers.'''
    text = text.lower()
    text = re.sub('\\[.*?\\]', '', text)
    text = re.sub('[%s]' % re.escape(string.punctuation), '', text)
    text = re.sub('\\w*\\d\\w*', '', text)
    text = re.sub("[0-9" "]+"," ",text)
    text = re.sub('[‘’“”…]', '', text)
    return text
clean = lambda x: clean_text(x)

In [8]:
st['Salary'] = st.Salary.apply(clean)
st.Salary

0
1
2
3
4
        ..
15055
15056
15057
15058
15059
Name: Salary, Length: 15060, dtype: object

In [9]:
st['native'] = st.native.apply(clean)
st.native

0         unitedstates
1         unitedstates
2         unitedstates
3         unitedstates
4         unitedstates
             ...
15055     unitedstates
15056     unitedstates
15057     unitedstates
15058     unitedstates
15059     unitedstates
Name: native, Length: 15060, dtype: object

In [10]:
st['sex'] = st.sex.apply(clean)
st.sex

0           male
1           male
2           male
3           male
4           male
          ...
15055       male
15056     female
15057       male
15058       male
15059       male
Name: sex, Length: 15060, dtype: object

In [11]:
 st['race'] = st.race.apply(clean)
st.race

0                    black
1                    white
2                    white
3                    black
4                    white
               ...
15055                white
15056                white
15057                white
15058     asianpacislander
15059                white
Name: race, Length: 15060, dtype: object

In [12]:
st['relationship'] = st.relationship.apply(clean)
st.relationship

0            ownchild
1             husband
2             husband
3             husband
4         notinfamily
             ...
15055        ownchild
15056     notinfamily
15057         husband
15058        ownchild
15059         husband
Name: relationship, Length: 15060, dtype: object

In [13]:
st['occupation'] = st.occupation.apply(clean)
st.occupation

0         machineopinspct
1          farmingfishing
2          protectiveserv
3         machineopinspct
4            otherservice
               ...
15055       profspecialty
15056       profspecialty
15057       profspecialty
15058         admclerical
15059      execmanagerial
Name: occupation, Length: 15060, dtype: object

In [14]:
st['maritalstatus'] = st.maritalstatus.apply(clean)
st.maritalstatus

0             nevermarried
1         marriedcivspouse
2         marriedcivspouse
3         marriedcivspouse
4             nevermarried
               ...
15055         nevermarried
15056             divorced
15057     marriedcivspouse
15058             divorced
15059     marriedcivspouse
Name: maritalstatus, Length: 15060, dtype: object

In [15]:
st['education'] = st.education.apply(clean)
st.education

0
1              hsgrad
2           assocacdm
3         somecollege
4
             ...
15055       bachelors
15056       bachelors
15057       bachelors
15058       bachelors
15059       bachelors
Name: education, Length: 15060, dtype: object

In [16]:
st['workclass'] = st.workclass.apply(clean)
st.workclass

0            private
1            private
2           localgov
3            private
4            private
            ...
15055        private
15056        private
15057        private
15058        private
15059     selfempinc
Name: workclass, Length: 15060, dtype: object

In [17]:
st.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  object
 2   education      15060 non-null  object
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  object
 5   occupation     15060 non-null  object
 6   relationship   15060 non-null  object
 7   race           15060 non-null  object
 8   sex            15060 non-null  object
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  object
 13  Salary         15060 non-null  object
dtypes: int64(5), object(9)
memory usage: 1.6+ MB

In [20]:
st['Salary'] = st.Salary.apply(clean)
st.Salary

0
1
2
3
4
        ..
15055
15056
15057
15058
15059
Name: Salary, Length: 15060, dtype: object